app/views/tokens/_selection.html.haml

  - Project.all.each do |a|
    - svcs = Service.where(project_id: a.id)
---
SELECT `services`.* FROM `services` WHERE `services`.`project_id` = 7