app/views/tokens/index.html.haml

  .span12
    -# @selected_envs.include?('All') ? envs = Environment.all.map{|c| c.name}.sort : envs = @selected_envs
---
SELECT `environments`.* FROM `environments` WHERE `environments`.`name` = 'qe01' LIMIT 1