app/views/projects/index.html.haml

            %i.icon-cogs
            = project.services.count
---
SELECT COUNT(*) FROM `services` WHERE `services`.`project_id` = 18

            %i.icon-cloud
            = project.deployments.count
---
SELECT COUNT(*) FROM `deployments` WHERE `deployments`.`project_id` = 18