app/controllers/deployments_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'pbindels' LIMIT 1
---
                            -d \"deployment[revision]=#{@artifact.name.gsub(/\.zip/,'')}\"         \
                            https://rpm.newrelic.com/deployments.xml")  if @environment.name == "prod1"

      @deployment.performTask("/usr/bin/curl -H \"x-api-key:#{nr_api_key}\"        \
                            -d \"deployment[app_name]=#{@project.code}-zend-#{@environment.name}\" \
                            -d \"deployment[revision]=#{@artifact.name.gsub(/\.zip/,'')}\"         \
                            https://rpm.newrelic.com/deployments.xml") if @environment.name == "prod1"  && @service.code == "king"

      @deployment.performTask("/usr/bin/curl \"https://api.honeybadger.io/v1/deploys"\
                            "?deploy\\[environment\\]=production&deploy\\[local_username\\]=#{@current_user.username}"\
                            "&deploy\\[revision\\]=#{@artifact.name.gsub(/\.zip/,'')}&api_key=#{hb_api_key}\"")  if @environment.name == "prod1"  && @service.code == "king"

      @deployment.performTask("/usr/bin/curl \"https://api.honeybadger.io/v1/deploys"\
                            "?deploy\\[environment\\]=#{@environment.name}&deploy\\[local_username\\]=#{@current_user.username}"\
                            "&deploy\\[revision\\]=#{@artifact.name.gsub(/\.zip/,'')}&api_key=#{hb_api_key}\"")  if @environment.name != "prod1"  && @service.code == "king"
    end
    get_status
  end

  def run_soarefresh
    refresh_params = params[:refresh]
    env = params[:environment_id]

    @soa_services=%w(payment_service site_configuration_service account_service product_service site_merchandising_service cart_service cerberus_service)
    @environment = Environment.find(refresh_params[:environment])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 18 LIMIT 1
SELECT `projects`.* FROM `projects`
SELECT `services`.* FROM `services` WHERE `services`.`project_id` = 6 AND `services`.`id` = 5 LIMIT 1
SELECT `artifacts`.* FROM `artifacts` WHERE `artifacts`.`project_id` = 6 AND `artifacts`.`service_id` = 5 ORDER BY `artifacts`.`created_at` DESC
SELECT `artifacts`.* FROM `artifacts` WHERE `artifacts`.`service_id` = 5 AND `artifacts`.`id` = 604 LIMIT 1
SELECT `environments`.* FROM `environments` INNER JOIN `service_to_environment` ON `environments`.`id` = `service_to_environment`.`environment_id` WHERE `service_to_environment`.`service_id` = 5 AND `environments`.`id` = 40 LIMIT 1
---
  def new
    if !params[:project_id].blank?
      @project = Project.find(params[:project_id])
    else
      @projects = Project.all
    end
    if !params[:service_id].blank?
      @service = @project.services.find(params[:service_id])
      @artifacts = Artifact.where(:project_id => @project.id, :service_id => @service.id).order(:created_at => :desc)
      @environments = @service.environments
    end

    if !params[:environment_id].blank?
      @environment = @service.environments.find(params[:environment_id])

SELECT 1 AS one FROM `services` WHERE (`services`.`code` = BINARY 'hostmgr' AND `services`.`id` != 5) LIMIT 1
SELECT `services`.* FROM `services` WHERE `services`.`id` = 5 ORDER BY `services`.`id` ASC LIMIT 1
SELECT 1 AS one FROM `artifacts` WHERE (`artifacts`.`name` = BINARY 'hostmgr-master_94.zip' AND `artifacts`.`id` != 604) LIMIT 1
SELECT `artifacts`.* FROM `artifacts` WHERE `artifacts`.`service_id` = 5 AND `artifacts`.`id` = 604 LIMIT 1
SELECT `environments`.* FROM `environments` INNER JOIN `service_to_environment` ON `environments`.`id` = `service_to_environment`.`environment_id` WHERE `service_to_environment`.`service_id` = 5 AND `environments`.`id` = 40 LIMIT 1
INSERT INTO `deployments` (`artifact_id`, `created_at`, `environment_id`, `project_id`, `service_id`, `updated_at`, `user_id`) VALUES (604, '2015-07-24 16:00:07', 40, 6, 5, '2015-07-24 16:00:07', 3)
---
  def create
    params[:environment_id] ? envs = params[:environment_id].split : envs = params[:env_names].split
    envs.length > 1 ? @multi = true : @multi = false
    params[:web_only] ? @hostfile = "web_hosts_only" : @hostfile = "hosts"
    (!params[:service_id].blank?)  ? (@service = Service.find(params[:service_id])) :  (@service = Service.find_by code: params[:service_code])
    (!params[:artifact_id].blank?) ? (@artifact = @service.artifacts.find(params[:artifact_id])) : (@artifact = @service.artifacts.find_by name: params[:artifact_name])

    envs.each do |e|
      if params[:environment_id]
        @environment = @service.environments.find(e)
      elsif params[:env_names]
        @environment = @service.environments.find_by name: e
      end

      lock_files = ["/okl/#{@project.code}/qdeploy/tmp/#{@project.code}\.#{@environment.name}.lock"]
      lock_files.push("#{@dbrefresh_root}/tmp/servicectl.#{@project.code}.#{@environment.name}.dbrefresh.sh.lock") if @project.code == "king"
      locks = Array.new
      lock_files.each do |lock|
        locks.push(lock) if File.exists?(lock)
      end

      if locks.length > 0
        @msg = "<font color=red> Deployment halted!</font> &nbsp&nbsp The following locks have been found: <font color=red>#{locks.join(",")}</font>.<br>"
        @failed = true
      else

        @deployment = Deployment.create!({
          :project_id => @project.id,
          :service_id => @service.id,
          :environment_id => @environment.id,
          :artifact_id => @artifact.id,
          :user_id => current_user.id,
          :web_only => params[:web_only]
        })

SELECT `deployments`.* FROM `deployments` WHERE `deployments`.`id` = 1472 LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 6 ORDER BY `projects`.`id` ASC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
---
        nr_api_key =  @environment.name == "prod1" ? @nr_api_keys["prod1"] : @nr_api_keys["non-prod1"]
        hb_api_key =  @environment.name == "prod1" ? @hb_api_keys["prod1"] : @hb_api_keys["non-prod1"]

        @deployment.performTask("/usr/bin/curl -H \"x-api-key:#{nr_api_key}\"        \
                              -d \"deployment[app_name]=#{@project.code}-#{@environment.name}\"      \
                              -d \"deployment[revision]=#{@artifact.name.gsub(/\.zip/,'')}\"         \
                              https://rpm.newrelic.com/deployments.xml")  if @environment.name == "prod1"

        @deployment.performTask("/usr/bin/curl -H \"x-api-key:#{nr_api_key}\"        \
                              -d \"deployment[app_name]=#{@project.code}-zend-#{@environment.name}\" \
                              -d \"deployment[revision]=#{@artifact.name.gsub(/\.zip/,'')}\"         \
                              https://rpm.newrelic.com/deployments.xml") if @environment.name == "prod1"  && @service.code == "king"

        @deployment.performTask("/usr/bin/curl \"https://api.honeybadger.io/v1/deploys"\
                              "?deploy\\[environment\\]=production&deploy\\[local_username\\]=#{@current_user.username}"\
                              "&deploy\\[revision\\]=#{@artifact.name.gsub(/\.zip/,'')}&api_key=#{hb_api_key}\"")  if @environment.name == "prod1"  && @service.code == "king"

        @deployment.performTask("/usr/bin/curl \"https://api.honeybadger.io/v1/deploys"\
                              "?deploy\\[environment\\]=#{@environment.name}&deploy\\[local_username\\]=#{@current_user.username}"\
                              "&deploy\\[revision\\]=#{@artifact.name.gsub(/\.zip/,'')}&api_key=#{hb_api_key}\"")  if @environment.name != "prod1"  && @service.code == "king"

        #UserMailer.status_email("pbindels@onekingslane.com", @current_user.username,
        #                      "@host", "Completed", @project.code, @environment.name, @artifact).deliver
      end
    end
    @project = Project.find(@project.id)