app/controllers/tokens_controller.rb

  def index
    params[:env_sel]                   = flash[:env_sel] if params[:env_sel].nil?
    params[:env_sel]                   = ["qe01"] if params[:env_sel].nil?
    params[:view]                      = flash[:view] if params[:view].nil?
    params[:project]                   = flash[:project]  if params[:project].nil?
    params[:service]                   = flash[:service]  if params[:service].nil?
    params[:sub_project]               = flash[:sub_project] if params[:sub_project].nil?
    params[:sub_project].nil? ? proj   = "" : proj = params[:sub_project].split(" - ")[0]
    params[:sub_project].nil? ? svc    = "" : svc = params[:sub_project].split(" - ")[1]

    #@selected_envs                     = params[:env_sel]
    @view_name                         = params[:view]
    @global_tokens                     = Token.global.order("LOWER(name) asc")
    @project                           = Project.where("name = ?", proj)
    @service                           = Service.where("name = ?", svc)

    @service_count                     = Service.count('project_id', :conditions => "project_id = #{@project.first.id}" ) if @project.first
---
SELECT `projects`.* FROM `projects` WHERE (name = '') ORDER BY `projects`.`id` ASC LIMIT 1
SELECT `projects`.* FROM `projects`
SELECT `services`.* FROM `services` WHERE `services`.`project_id` = 2