app/views/deployments/_bulkrefresh.html.haml

SELECT `environments`.* FROM `environments` WHERE (name not like '%prod%' and name != 'int06' and name != 'int15')
---

      = f.input :environment, :prompt => "Select Environment",  label: false,
        :collection => Environment.where("name not like '%prod%' and name != 'int06' and name != 'int15'").sort{|a,b| a.name <=> b.name }, :include_blank => false