app/views/deployments/new.html.haml

SELECT `environments`.* FROM `environments` INNER JOIN `service_to_environment` ON `environments`.`id` = `service_to_environment`.`environment_id` WHERE `service_to_environment`.`service_id` = 5 AND `environments`.`id` = 40 LIMIT 1
---
      - pds  = Array.new
      - @service.environments.sort{|a,b| a.name.downcase <=> b.name.downcase}.each do |u|

SELECT `services`.* FROM `services` WHERE `services`.`project_id` = 6 AND `services`.`id` = 5 LIMIT 1
---
    %ul.nav.nav-tabs.nav-stacked
      -@project.services.sort{|a,b| a.name.downcase <=> b.name.downcase}.each do |service|